[M_Sage_NowYouSeeIt MissionDefinition]
MissionDescription="There are terrifying creatures called bloodtails that attract certain types of pheromones. Hammerlock will give you the desired vial of pheromone.<br><br>When you're ready, Hammerlock will ask you to use pheromones to chase the werewolf away."
TeaserText="They are ready for what they smell.?"
